Repository: kirchimol/fastfood_order
Catalog: Resources/BotLocalizer.*.resx
Languages: ru, uz

# phone-Number
source: Send your phone number 👇
ru: Отправить номер телефона 👇
uz: Telefon raqamingizni jo'nating 👇

source: Send 📞
ru: Отправить 📞
uz: Yuborish 📞

source: To order 🌟
ru: Заказать 🌟
uz: Buyurtma berish 🌟

source: Settings ⚙️
ru: Hастройки ⚙️
uz: Sozlamalar ⚙️

# send-location
source: Submit your address📍
ru: Oтправка адреса📍
uz: Manzilingizni jo'nating 📍

# information-fastfood
source: Information about fast foods 🌭
ru: Информация о фастфуде 🌭
uz: Fastfoodlar haqida ma'lumot 🌭

# fastfood-list
source: List of fast foods 🍔
ru: Список фастфудов 🍔
uz: Fastfoodlar ro'yxati 🍔

# return-menu
source: Return to main menu 👈
ru: Вернуться в Главное меню 👈
uz: Asosiy menyuga qaytish 👈

# place-order
source: Order information and price 💰
ru: Информация о заказе и цена💰
uz: Buyurtma haqida ma'lumot va narxi 💰

# get-going
source: Choose to pick up 🚶🏻
ru: Выбор, чтобы пойти 🚶🏻
uz: Borib olishni tanlash 🚶🏻

# be-delivered
source: Choose delivery 🚚
ru: Выбрать доставку 🚚
uz: Yetkazib berilshni tanlash 🚚

# branch-selection
source: Choose which branch to pick up 🏪
ru: Выберите, из какой ветки вы будете получать 🏪
uz: Qaysi filialdan olishingizni tanlang 🏪

source: Our-information 👥
ru: О нас 👥
uz: Biz haqimizda 👥

source: Buy 💵
ru: Покупка 💵
uz: Sotib olish 💲

source: Continue shopping 💲
ru: Продолжить покупку 💲
uz: Xaridni davom ettirish 💵

# russia
source: Pусский 🇷🇺
uz: Русский 🇷🇺

# choose-language
source: Select language 🇺🇸
ru: Выбор языка 🇷🇺
uz: Tilni tanlash 🇺🇿

source: Drinks 🍹
ru: Напитки 🍹
uz: Ichimliklar 🍹

# next
source: Continue ⏩
ru: Продолжать ⏩
uz: Davom etish ⏩

# language-changed
source: Language changed successfully ✅
ru: Язык успешно изменен ✅
uz: Til muvofaqqiyatli o'zgartirildi ✅

# choose-thing
source: Your cart is empty, select a product to order 📦
ru: Ваша корзина пуста, выберите товар для заказа 📦
uz: Sizning savatingiz bo'sh , buyurtma berish uchun mahsulot tanlang 📦

# motto
source: Welcome to Burdog fastfood shop! Now we offer you a simple and time-consuming registration process.
ru: Добро пожаловать в магазин быстрого питания Burdog! Теперь мы предлагаем вам простой и трудоемкий процесс регистрации.
uz: Burdog fastfood botiga xush kelibsiz! Endi esa sizga sodda va ko’p vaqt olmaydigan ro’yhatdan o’tish jarayonini taklif etamiz.

source: ◀️ Back
ru: ◀️ Назад
uz: ◀️ Ortga

# phone-requirement
source: 📱 What is your phone number? To send your phone number, click the "Send my number" button below or 📱 Send the number as +998 *** **
ru: 📱 Какой у вас номер телефона? Чтобы отправить свой номер телефона, нажмите кнопку «Отправить мой номер» ниже или 📱 Отправьте номер как +998 *** **
uz: 📱 Telefon raqamingiz qanday? Telefon raqamingizni jo'natish uchun, quyidagi "📱 Raqamimni jo'natish" tugmasini bosing yoki 📱 Raqamni +998 *** ** shaklida yuboring

# choose-setting
source: What would you like to change?
ru: Что бы вы хотели изменить?
uz: Nimani o'zgartirmoqchisiz?

# bot-about
source: Our bot Marva belongs to an institution that prepares fast food, Feed your belly through it Contact: +998-xx-xxx-xx-xx Admin: @ooo
ru: Наш бот Marva относится к заведению, которое готовит фаст-фуд, Кормите свой живот через это Контакт: +998-хх-ххх-хх-хх Админ: @ооо
uz: Botimiz Marva fastfood tayyorlaydigan muassassaga tegishli, U orqali qorningizni to'ydiring A'loqa: +998-xx-xxx-xx-xx Admin: @ooo

# main-menu
source: Main section 📜
ru: Основной раздел 📜
uz: Asosiy bo'lim 📜

# choose-food
source: Choose one of the fast foods 🌭
ru: Выберите один из фаст-фудов 🌭
uz: Fastfoodlardan birini tanlang 🌭

# choose-drink
source: Choose one of the drinks 🍼
ru: Выберите один из напитков 🍼
uz: Ichimliklarning birini tanlang 🍼

# food-count
source: How much do you get from a hot dog❓
ru: Сколько вы получаете от хот-дога❓
uz: Hot-dogdan nechta olasiz ❓

source: Juice 🧃
uz: Sharbat 🧃

# send-locations
source: Send us your location 👇
ru: Отправьте нам свое местоположение 👇
uz: Bizga joylashuvingizni jo'nating 👇

# sending-locations
source: 📍 Send
ru: 📍 Отправить
uz: 📍 Jo'natish

# menu-hotdog
source: Menu of Hot dogs 📜
ru: Меню хот-догов 📜
uz: Hot-doglar menyusi 📜

# true
source: Yes ✔️
ru: Да ✔️
uz: Ha ✔️

# false
source: No ✖️
ru: Нет ✖️
uz: Yo'q ✖️

# shopping
source: Click «Continue ⏩» if your purchase is finished, or «Continue Shopping 💵» if you want to add something else!
ru: Нажмите «Продолжить ⏩», если ваша покупка завершена, или «Продолжить покупки 💵», если вы хотите добавить что-то еще!
uz: Xaridingiz tugagan bo'lsa «Davom etish ⏩» ni, yoki yana biron narsa qo'shmoqchi bo'sangiz «Xaridni davom ettirish 💵» ni bosing!

# true-location
source: Are you sure the location you submitted is correct?
ru: Вы уверены, что указали правильное местоположение?
uz: Siz yuborgan joylashuv to'g'riligiga aminmisiz?

# orders
source: 🧾 Order list:
ru: 🧾 Состав заказа:
uz: 🧾 Buyurtma tarkibi:

# totalPrice
source: 💸 Total :
ru: 💸 Итого: {
uz: 💸 Jami:

source: UZS
ru: сум
uz: so'm

# endBuy
source: Complete your order?
ru: Завершить заказ?
uz: Buyurtmangizni yakunlaysizmi?

# ended
source: Finish
ru: Заканчивать
uz: Yakunlash

# go-shop
source: Shopping
ru: Покупка
uz: Xarid yana qilish
